case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{


    cylinder
    {
       // type            fixedFluxPressure;
        //value          uniform 0;
        type zeroGradient;
    }

    cylinder_out
    {
        type            outletInlet;
        outletValue  uniform 0;
        value uniform 0;
    }
frontAndBack
    {
               type            empty;
    }
}


// ************************************************************************* //
