case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "0.005/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    cylinder_out
    {
        type            patch;
        nFaces          500;
        startFace       499500;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          500;
        startFace       500000;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          500000;
        startFace       500500;
    }
)

// ************************************************************************* //
